tap "homebrew/core"

# 基础工具
brew "git"
brew "gh"
brew "rsync"
brew "wget"
brew "curl"
brew "tree"
brew "jq"
brew "yq"

# 搜索 & 终端效率
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tmux"
brew "neovim"
brew "htop"

# 容器 & 云
brew "docker"        # CLI only
brew "kubectl"
brew "helm"
brew "terraform"

# 网络 / 调试
brew "httpie"
brew "nmap"
